micropython/micropython/ports/esp32/esp32_can.c
/* The MIT License (MIT)
 *
 * Copyright (c) 2019 Musumeci Salvatore
 * Copyright (c) 2021 Ihor Nehrutsa
 * Copyright (c) 2022 Yuriy Makarov
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
#include <string.h>

#include "py/objarray.h"
#include "py/binary.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "freertos/task.h"
#include "esp_idf_version.h"

// CAN only for ESP-IDF v4.2 and higher because of "driver/twai.h"
#if (ESP_IDF_VERSION_MAJOR == 4) && (ESP_IDF_VERSION_MINOR >= 2)

#include "driver/twai.h"
#include "esp_task.h"
#include "esp32_can.h"

#if MICROPY_HW_ENABLE_CAN

// TWAI_MODE_NORMAL      - Normal operating mode where TWAI controller can send/receive/acknowledge messages
// TWAI_MODE_NO_ACK      - Transmission does not require acknowledgment. Use this mode for self testing. // This mode is useful when self testing the TWAI controller (loopback of transmissions).
// TWAI_MODE_LISTEN_ONLY - The TWAI controller will not influence the bus (No transmissions or acknowledgments) but can receive messages. // This mode is suited for bus monitor applications.

#define CAN_MODE_NORMAL             TWAI_MODE_NORMAL
#define CAN_MODE_LOOPBACK           TWAI_MODE_NO_ACK
#define CAN_MODE_SILENT             TWAI_MODE_LISTEN_ONLY
#define CAN_MODE_SILENT_LOOPBACK    (0x10)

#define CAN_TASK_PRIORITY           (ESP_TASK_PRIO_MIN + 1)
#define CAN_TASK_STACK_SIZE         (1024)
#define CAN_DEFAULT_PRESCALER       (8)
#define CAN_DEFAULT_SJW             (3)
#define CAN_DEFAULT_BS1             (15)
#define CAN_DEFAULT_BS2             (4)
#define CAN_MAX_DATA_FRAME          (8)

// INTERNAL Deinitialize can
void can_deinit(const esp32_can_obj_t *self) {
    check_esp_err(twai_stop());
    check_esp_err(twai_driver_uninstall());
    if (self->irq_handler != NULL) {
        vTaskDelete(self->irq_handler);
    }
    self->config->initialized = false;
}

// singleton CAN device object
esp32_can_config_t can_config = {
    .general = TWAI_GENERAL_CONFIG_DEFAULT(GPIO_NUM_2, GPIO_NUM_4, CAN_MODE_NORMAL),
    .filter = TWAI_FILTER_CONFIG_ACCEPT_ALL(),
    .timing = TWAI_TIMING_CONFIG_25KBITS(),
    .initialized = false
};

STATIC esp32_can_obj_t esp32_can_obj = {
    {&esp32_can_type},
    .config = &can_config
};

// INTERNAL FUNCTION Return status information
STATIC twai_status_info_t _esp32_hw_can_get_status() {
    twai_status_info_t status;
    check_esp_err(twai_get_status_info(&status));
    return status;
}

// INTERNAL FUNCTION Reset can filter to defaults
void esp32_reset_can_filter(const esp32_can_obj_t *self) {
    twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();
    self->config->filter.single_filter = f_config.single_filter;
    self->config->filter.acceptance_code = f_config.acceptance_code;
    self->config->filter.acceptance_mask = f_config.acceptance_mask;
}

STATIC void esp32_hw_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->config->initialized) {
        qstr mode = MP_QSTR_LISTEN;
        switch (self->config->general.mode) {
            case CAN_MODE_LOOPBACK:
                mode = MP_QSTR_LOOPBACK;
                break;
            case CAN_MODE_SILENT:
                mode = MP_QSTR_SILENT;
                break;
            case CAN_MODE_NORMAL:
                mode = MP_QSTR_NORMAL;
                break;
        }
        mp_printf(print, "CAN(tx=%u, rx=%u, baudrate=%ukb, mode=%q, loopback=%u)",
            self->config->general.tx_io,
            self->config->general.rx_io,
            self->config->baudrate,
            mode,
            self->loopback
            );
    } else {
        mp_printf(print, "Device is not initialized");
    }
}

// INTERNAL FUNCTION FreeRTOS IRQ task
STATIC void esp32_hw_can_irq_task(void *self_in) {
    esp32_can_obj_t *self = (esp32_can_obj_t *)self_in;
    uint32_t alerts;

    twai_reconfigure_alerts(
        TWAI_ALERT_RX_DATA | TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_BUS_OFF | TWAI_ALERT_ERR_PASS |
        TWAI_ALERT_ABOVE_ERR_WARN | TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS | TWAI_ALERT_BUS_RECOVERED,
        NULL
        );

    while (1) {
        check_esp_err(twai_read_alerts(&alerts, portMAX_DELAY));

        if (alerts & TWAI_ALERT_BUS_OFF) {
            ++self->num_bus_off;
        }
        if (alerts & TWAI_ALERT_ERR_PASS) {
            ++self->num_error_passive;
        }
        if (alerts & TWAI_ALERT_ABOVE_ERR_WARN) {
            ++self->num_error_warning;
        }

        if (alerts & (TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS)) {
            self->last_tx_success = (alerts & TWAI_ALERT_TX_SUCCESS) > 0;
        }

        if (alerts & (TWAI_ALERT_BUS_RECOVERED)) {
            self->bus_recovery_success = true;
        }

        if (self->rxcallback != mp_const_none) {
            if (alerts & TWAI_ALERT_RX_DATA) {
                uint32_t msgs_to_rx = _esp32_hw_can_get_status().msgs_to_rx;

                if (msgs_to_rx == 1) {
                    // first message in queue
                    mp_sched_schedule(self->rxcallback, MP_OBJ_NEW_SMALL_INT(0));
                } else if (msgs_to_rx >= self->config->general.rx_queue_len) {
                    // queue is full
                    mp_sched_schedule(self->rxcallback, MP_OBJ_NEW_SMALL_INT(1));
                }
            }
            if (alerts & TWAI_ALERT_RX_QUEUE_FULL) {
                // queue overflow
                mp_sched_schedule(self->rxcallback, MP_OBJ_NEW_SMALL_INT(2));
            }
        }
    }
}

// init(mode, tx=5, rx=4, baudrate=500000, prescaler=8, sjw=3, bs1=15, bs2=4, auto_restart=False, tx_queue=1, rx_queue=1)
STATIC mp_obj_t esp32_hw_can_init_helper(esp32_can_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_prescaler, ARG_sjw, ARG_bs1, ARG_bs2, ARG_auto_restart, ARG_baudrate,
           ARG_tx_io, ARG_rx_io, ARG_tx_queue, ARG_rx_queue};
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,         MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = CAN_MODE_NORMAL} },
        { MP_QSTR_prescaler,    MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_PRESCALER} },
        { MP_QSTR_sjw,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_SJW} },
        { MP_QSTR_bs1,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_BS1} },
        { MP_QSTR_bs2,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_BS2} },
        { MP_QSTR_auto_restart, MP_ARG_BOOL,                    {.u_bool = false} },
        { MP_QSTR_baudrate,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 500000} },
        { MP_QSTR_tx,           MP_ARG_INT,                     {.u_int = 4} },
        { MP_QSTR_rx,           MP_ARG_INT,                     {.u_int = 5} },
        { MP_QSTR_tx_queue,     MP_ARG_INT,                     {.u_int = 1} },
        { MP_QSTR_rx_queue,     MP_ARG_INT,                     {.u_int = 1} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

