micropython/micropython/ports/esp32/esp32_can.c
    // Configure device
    const int mode = args[ARG_mode].u_int;
    self->loopback = false;
    self->config->baudrate = args[ARG_baudrate].u_int;
    if (mode == CAN_MODE_SILENT_LOOPBACK) {
        self->config->general.mode = TWAI_MODE_NO_ACK;
        self->loopback = true;
    } else {
        self->config->general.mode = mode & 0x0F;
    }
    self->config->general.tx_io = args[ARG_tx_io].u_int;
    self->config->general.rx_io = args[ARG_rx_io].u_int;
    self->config->general.clkout_io = TWAI_IO_UNUSED;
    self->config->general.bus_off_io = TWAI_IO_UNUSED;
    self->config->general.tx_queue_len = args[ARG_tx_queue].u_int;
    self->config->general.rx_queue_len = args[ARG_rx_queue].u_int;
    self->config->general.alerts_enabled = TWAI_ALERT_NONE;
    self->config->general.clkout_divider = 0;
    if (args[ARG_auto_restart].u_bool) {
        mp_raise_NotImplementedError("Auto-restart not supported");
    }
    esp32_reset_can_filter(self);

    // clear errors
    self->num_error_warning = 0;
    self->num_error_passive = 0;
    self->num_bus_off = 0;

    // Calculate CAN nominal bit timing from baudrate if provided
    twai_timing_config_t *timing;
    switch ((int)args[ARG_baudrate].u_int) {
        case 0:
            timing = &((twai_timing_config_t) {
            .brp = args[ARG_prescaler].u_int,
            .sjw = args[ARG_sjw].u_int,
            .tseg_1 = args[ARG_bs1].u_int,
            .tseg_2 = args[ARG_bs2].u_int,
            .triple_sampling = false
        });
            break;
        #ifdef TWAI_TIMING_CONFIG_1KBITS
        case 1000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_1KBITS());
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_5KBITS
        case 5000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_5KBITS());
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_10KBITS
        case 10000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_10KBITS());
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_12_5KBITS
        case 12500:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_12_5KBITS());
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_16KBITS
        case 16000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_16KBITS());
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_20KBITS
        case 20000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_20KBITS());
            break;
        #endif
        case 25000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_25KBITS());
            break;
        case 50000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_50KBITS());
            break;
        case 100000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_100KBITS());
            break;
        case 125000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_125KBITS());
            break;
        case 250000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_250KBITS());
            break;
        case 500000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_500KBITS());
            break;
        case 800000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_800KBITS());
            break;
        case 1000000:
            timing = &((twai_timing_config_t)TWAI_TIMING_CONFIG_1MBITS());
            break;
        default:
            mp_raise_ValueError("Unable to set baudrate");
            self->config->baudrate = 0;
            return mp_const_none;
    }
    self->config->timing = *timing;

    check_esp_err(twai_driver_install(&self->config->general, &self->config->timing, &self->config->filter));
    check_esp_err(twai_start());
    if (xTaskCreatePinnedToCore(esp32_hw_can_irq_task, "can_irq_task", CAN_TASK_STACK_SIZE, self, CAN_TASK_PRIORITY, (TaskHandle_t *)&self->irq_handler, MP_TASK_COREID) != pdPASS) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("failed to create can irq task handler"));
    }
    self->config->initialized = true;

    return mp_const_none;
}

// CAN(bus, ...) No argument to get the object
STATIC mp_obj_t esp32_hw_can_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
    if (mp_obj_is_int(args[0]) != true) {
        mp_raise_TypeError("bus must be a number");
    }

    // work out port
    mp_uint_t can_idx = mp_obj_get_int(args[0]);
    if (can_idx != 0) {
        mp_raise_msg_varg(&mp_type_ValueError, "CAN(%d) doesn't exist", can_idx);
    }

    esp32_can_obj_t *self = &esp32_can_obj;
    if (!self->config->initialized || n_args > 1 || n_kw > 0) {
        if (self->config->initialized) {
            // The caller is requesting a reconfiguration of the hardware
            // this can only be done if the hardware is in init mode
            can_deinit(self);
        }
        self->rxcallback = mp_const_none;
        self->irq_handler = NULL;

        if (n_args > 1 || n_kw > 0) {
            // start the peripheral
            mp_map_t kw_args;
            mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
            esp32_hw_can_init_helper(self, n_args - 1, args + 1, &kw_args);
        }
    }
    return MP_OBJ_FROM_PTR(self);
}

// init(tx, rx, baudrate, mode=CAN_MODE_NORMAL, tx_queue=2, rx_queue=5)
STATIC mp_obj_t esp32_hw_can_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    return esp32_hw_can_init_helper(MP_OBJ_TO_PTR(args[0]), n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(esp32_hw_can_init_obj, 1, esp32_hw_can_init);

// deinit()
STATIC mp_obj_t esp32_hw_can_deinit(const mp_obj_t self_in) {
    const esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    can_deinit(self);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(esp32_hw_can_deinit_obj, esp32_hw_can_deinit);

// Force a software restart of the controller, to allow transmission after a bus error
STATIC mp_obj_t esp32_hw_can_restart(mp_obj_t self_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    twai_status_info_t status = _esp32_hw_can_get_status();
    if (!self->config->initialized || status.state != TWAI_STATE_BUS_OFF) {
        mp_raise_ValueError(NULL);
    }

    self->bus_recovery_success = -1;
    check_esp_err(twai_initiate_recovery());

    while (self->bus_recovery_success < 0) {
        MICROPY_EVENT_POLL_HOOK
    }

